10/data/attachments/14318c83e6eeaafc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_sound_Friend_36307_9</nif:username>
            <nif:friendToBeRequested>soap_friends_da43d4b2-65a0-4329-bc51-925740fe1f36</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>